[
    {
      "Muscles": "Biceps",
      "WorkOut": "Barbell Curl",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell",
      "Explaination": "Barbell Curl: Stand with feet shoulder-width apart, hold a barbell with an underhand grip and curl it towards your shoulders.",
      "Long Explanation": "This classic bicep-building exercise involves standing with feet shoulder-width apart, gripping a barbell with an underhand grip. With elbows close to the torso, curl the barbell towards the shoulders while keeping the upper arms stationary. This motion targets the bicep muscles, including both the long and short head, providing development in muscle mass and arm strength. The focus is on smooth, controlled movements, exhaling as you lift the barbell and inhaling on the return. For beginners, it's crucial to start with a lighter weight to perfect the form before progressing.",
      "Video": "https://www.youtube.com/results?search_query=Barbell+Curl"
    },
    {
      "Muscles": "Biceps",
      "WorkOut": "Dumbbell Curl",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbells",
      "Explaination": "Dumbbell Curl: Curl dumbbells alternately or simultaneously while keeping your elbows close to your torso.",
      "Long Explanation": "The Dumbbell Curl is a weight training exercise targeting the Biceps. It involves using Dumbbells, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Dumbbell+Curl"
    },
    {
      "Muscles": "Biceps",
      "WorkOut": "Hammer Curl",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbells",
      "Explaination": "Hammer Curl: Perform dumbbell curls with palms facing each other, targeting the brachialis muscle.",
      "Long Explanation": "The Hammer Curl is a weight training exercise targeting the Biceps. It involves using Dumbbells, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Hammer+Curl"
    },
    {
      "Muscles": "Biceps",
      "WorkOut": "Preacher Curl",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Preacher bench and barbell or dumbbell",
      "Explaination": "Preacher Curl: Use a preacher bench to isolate biceps, keeping the upper arms stationary.",
      "Long Explanation": "The Preacher Curl is a weight training exercise targeting the Biceps. It involves using Preacher bench and barbell or dumbbell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Preacher+Curl"
    },
    {
      "Muscles": "Biceps",
      "WorkOut": "Concentration Curl",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbell",
      "Explaination": "Concentration Curl: Sit with a dumbbell in one hand, elbow on the thigh, and curl the weight focusing on the bicep.",
      "Long Explanation": "The Concentration Curl is a weight training exercise targeting the Biceps. It involves using Dumbbell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Concentration+Curl"
    },
    {
      "Muscles": "Biceps",
      "WorkOut": "Cable Curl",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Cable machine with bar attachment",
      "Explaination": "Cable Curl: Use a cable machine with a bar attachment, curling the bar towards your chest.",
      "Long Explanation": "The Cable Curl is a weight training exercise targeting the Biceps. It involves using Cable machine with bar attachment, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Cable+Curl"
    },
    {
      "Muscles": "Biceps",
      "WorkOut": "EZ-Bar Curl",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "EZ-bar",
      "Explaination": "EZ-Bar Curl: Curl an EZ-bar with both hands, which can be easier on your wrists.",
      "Long Explanation": "The EZ-Bar Curl is a weight training exercise targeting the Biceps. It involves using EZ-bar, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=EZ-Bar+Curl"
    },
    {
      "Muscles": "Biceps",
      "WorkOut": "Incline Dumbbell Curl",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbells and an incline bench",
      "Explaination": "Incline Dumbbell Curl: Lie back on an incline bench, curl dumbbells with arms hanging down.",
      "Long Explanation": "The Incline Dumbbell Curl is a weight training exercise targeting the Biceps. It involves using Dumbbells and an incline bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Incline+Dumbbell+Curl"
    },
    {
      "Muscles": "Biceps",
      "WorkOut": "Reverse Barbell Curl",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell",
      "Explaination": "Reverse Barbell Curl: Grip the barbell overhand and curl, targeting the forearms and biceps.",
      "Long Explanation": "The Reverse Barbell Curl is a weight training exercise targeting the Biceps. It involves using Barbell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Reverse+Barbell+Curl"
    },
    {
      "Muscles": "Biceps",
      "WorkOut": "Seated Alternating Dumbbell Curl",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbells and a bench",
      "Explaination": "Seated Alternating Dumbbell Curl: Alternate curling dumbbells while seated, focusing on each bicep.",
      "Long Explanation": "The Seated Alternating Dumbbell Curl is a weight training exercise targeting the Biceps. It involves using Dumbbells and a bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Seated+Alternating+Dumbbell+Curl"
    },
    {
      "Muscles": "Biceps",
      "WorkOut": "Zottman Curl",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbells",
      "Explaination": "Zottman Curl: Curl dumbbells up normally and rotate your wrists at the top to descend with an overhand grip.",
      "Long Explanation": "The Zottman Curl is a weight training exercise targeting the Biceps. It involves using Dumbbells, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Zottman+Curl"
    },
    {
      "Muscles": "Biceps",
      "WorkOut": "Resistance Band Bicep Curl",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Resistance band",
      "Explaination": "Resistance Band Bicep Curl: Stand on a resistance band and curl your hands towards your shoulders.",
      "Long Explanation": "The Resistance Band Bicep Curl is a weight training exercise targeting the Biceps. It involves using Resistance band, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Resistance+Band+Bicep+Curl"
    },
    {
      "Muscles": "Biceps",
      "WorkOut": "Chin-Up",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Pull-up bar",
      "Explaination": "Chin-Up: Grip a bar with palms facing you and pull yourself up, focusing on biceps.",
      "Long Explanation": "The Chin-Up is a weight training exercise targeting the Biceps. It involves using Pull-up bar, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Chin-Up"
    },
    {
      "Muscles": "Biceps",
      "WorkOut": "Machine Bicep Curl",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Bicep curl machine",
      "Explaination": "Machine Bicep Curl: Use a bicep curl machine, focusing on isolating the bicep muscle.",
      "Long Explanation": "The Machine Bicep Curl is a weight training exercise targeting the Biceps. It involves using Bicep curl machine, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Machine+Bicep+Curl"
    },
    {
      "Muscles": "Biceps",
      "WorkOut": "Spider Curl",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Bench (preferably inclined) and barbell or dumbbells",
      "Explaination": "Spider Curl: Lie face down on an incline bench and curl barbells, isolating biceps.",
      "Long Explanation": "The Spider Curl is a weight training exercise targeting the Biceps. It involves using Bench (preferably inclined) and barbell or dumbbells, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Spider+Curl"
    },
    {
      "Muscles": "Triceps",
      "WorkOut": "Tricep Dips",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Parallel bars or a bench",
      "Explaination": "Tricep Dips: Use parallel bars or a bench, lower your body by bending your arms, then push back up.",
      "Long Explanation": "The Tricep Dips is a weight training exercise targeting the Triceps. It involves using Parallel bars or a bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Tricep+Dips"
    },
    {
      "Muscles": "Triceps",
      "WorkOut": "Skull Crushers (Lying Tricep Extensions)",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell or dumbbells and a bench",
      "Explaination": "Skull Crushers (Lying Tricep Extensions): Lie on a bench, extend arms with weight, lower it towards your forehead, then extend back up.",
      "Long Explanation": "The Skull Crushers (Lying Tricep Extensions) is a weight training exercise targeting the Triceps. It involves using Barbell or dumbbells and a bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Skull+Crushers"
    },
    {
      "Muscles": "Triceps",
      "WorkOut": "Close-Grip Bench Press",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell or dumbbells",
      "Explaination": "Close-Grip Bench Press: Bench press with hands closer together, focusing on triceps more than chest.",
      "Long Explanation": "The Close-Grip Bench Press is a weight training exercise targeting the Triceps. It involves using Barbell or dumbbells, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Close-Grip+Bench+Press"
    },
    {
      "Muscles": "Triceps",
      "WorkOut": "Overhead Tricep Extension",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbell or kettlebell",
      "Explaination": "Overhead Tricep Extension: Stand or sit, extend a weight over your head, then bend and straighten your elbows.",
      "Long Explanation": "The Overhead Tricep Extension is a weight training exercise targeting the Triceps. It involves using Dumbbell or kettlebell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Overhead+Tricep+Extension"
    },
    {
      "Muscles": "Triceps",
      "WorkOut": "Tricep Pushdown",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Cable machine with bar attachment",
      "Explaination": "Tricep Pushdown: On a cable machine, push the bar down until arms are extended, focusing on triceps.",
      "Long Explanation": "The Tricep Pushdown is a weight training exercise targeting the Triceps. It involves using Cable machine with bar attachment, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Tricep+Pushdown"
    },
    {
      "Muscles": "Triceps",
      "WorkOut": "Diamond Push-Ups",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Diamond Push-Ups: Place hands close together in a diamond shape, lower your body, and push up, targeting triceps.",
      "Long Explanation": "The Diamond Push-Ups is a weight training exercise targeting the Triceps. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Diamond+Push-Ups"
    },
    {
      "Muscles": "Triceps",
      "WorkOut": "Cable Overhead Tricep Extension",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Cable machine with rope attachment",
      "Explaination": "Cable Overhead Tricep Extension: Face away from a cable machine, extend arms overhead, and bend/extend your elbows.",
      "Long Explanation": "The Cable Overhead Tricep Extension is a weight training exercise targeting the Triceps. It involves using Cable machine with rope attachment, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Cable+Overhead+Tricep+Extension"
    },
    {
      "Muscles": "Triceps",
      "WorkOut": "Single-Arm Dumbbell Extension",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbell",
      "Explaination": "Single-Arm Dumbbell Extension: Overhead extension using a dumbbell, performed one arm at a time for focused tricep work.",
      "Long Explanation": "The Single-Arm Dumbbell Extension is a weight training exercise targeting the Triceps. It involves using Dumbbell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Single-Arm+Dumbbell+Extension"
    },
    {
      "Muscles": "Triceps",
      "WorkOut": "Kickbacks",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbell",
      "Explaination": "Kickbacks: Lean forward, move a dumbbell back until your arm is straight, focusing on the tricep.",
      "Long Explanation": "The Kickbacks is a weight training exercise targeting the Triceps. It involves using Dumbbell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Kickbacks"
    },
    {
      "Muscles": "Triceps",
      "WorkOut": "Rope Pushdown",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Cable machine with rope attachment",
      "Explaination": "Rope Pushdown: Using a rope attachment on a cable machine, push down, extending arms and then return.",
      "Long Explanation": "The Rope Pushdown is a weight training exercise targeting the Triceps. It involves using Cable machine with rope attachment, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Rope+Pushdown"
    },
    {
      "Muscles": "Triceps",
      "WorkOut": "Tricep Machine Press",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Tricep press machine",
      "Explaination": "Tricep Machine Press: Use a tricep press machine, push the weight down until arms are fully extended.",
      "Long Explanation": "The Tricep Machine Press is a weight training exercise targeting the Triceps. It involves using Tricep press machine, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Tricep+Machine+Press"
    },
    {
      "Muscles": "Triceps",
      "WorkOut": "Bench Dips",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Bench",
      "Explaination": "Bench Dips: Using a bench or chair, lower your body by bending your arms and then push back up.",
      "Long Explanation": "The Bench Dips is a weight training exercise targeting the Triceps. It involves using Bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Bench+Dips"
    },
    {
      "Muscles": "Triceps",
      "WorkOut": "Resistance Band Tricep Extension",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Resistance band",
      "Explaination": "Resistance Band Tricep Extension: Use a resistance band, extend your arms down or overhead, focusing on triceps.",
      "Long Explanation": "The Resistance Band Tricep Extension is a weight training exercise targeting the Triceps. It involves using Resistance band, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Resistance+Band+Tricep+Extension"
    },
    {
      "Muscles": "Triceps",
      "WorkOut": "Kettlebell Overhead Extension",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Kettlebell",
      "Explaination": "Kettlebell Overhead Extension: Hold a kettlebell with both hands, extend arms overhead, then bend and straighten elbows.",
      "Long Explanation": "The Kettlebell Overhead Extension is a weight training exercise targeting the Triceps. It involves using Kettlebell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Kettlebell+Overhead+Extension"
    },
    {
      "Muscles": "Triceps",
      "WorkOut": "Tricep Push-Up",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Tricep Push-Up: Similar to a standard push-up but with hands closer to work the triceps more intensely.",
      "Long Explanation": "The Tricep Push-Up is a weight training exercise targeting the Triceps. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Tricep+Push-Up"
    },
    {
      "Muscles": "Chest",
      "WorkOut": "Bench Press",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell and bench",
      "Explaination": "Bench Press: Lie on a bench, press a barbell up from your chest, then lower it back down.",
      "Long Explanation": "The Bench Press is a weight training exercise targeting the Chest. It involves using Barbell and bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Bench+Press"
    },
    {
      "Muscles": "Chest",
      "WorkOut": "Push-Ups",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Push-Ups: Keep your body straight and lower it to the ground by bending your arms, then push back up.",
      "Long Explanation": "The Push-Ups is a weight training exercise targeting the Chest. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Push-Ups"
    },
    {
      "Muscles": "Chest",
      "WorkOut": "Incline Bench Press",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell and incline bench",
      "Explaination": "Incline Bench Press: Perform a bench press on an inclined bench to target the upper chest.",
      "Long Explanation": "The Incline Bench Press is a weight training exercise targeting the Chest. It involves using Barbell and incline bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Incline+Bench+Press"
    },
    {
      "Muscles": "Chest",
      "WorkOut": "Decline Bench Press",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell and decline bench",
      "Explaination": "Decline Bench Press: Use a decline bench for bench pressing, focusing on the lower chest.",
      "Long Explanation": "The Decline Bench Press is a weight training exercise targeting the Chest. It involves using Barbell and decline bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Decline+Bench+Press"
    },
    {
      "Muscles": "Chest",
      "WorkOut": "Dumbbell Flyes",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbells and a bench",
      "Explaination": "Dumbbell Flyes: Lie on a bench, extend arms with dumbbells, and bring them together in an arc motion.",
      "Long Explanation": "The Dumbbell Flyes is a weight training exercise targeting the Chest. It involves using Dumbbells and a bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Dumbbell+Flyes"
    },
    {
      "Muscles": "Chest",
      "WorkOut": "Cable Crossovers",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Cable machine with pulley system",
      "Explaination": "Cable Crossovers: Stand between two cable stations, pull handles together in front of you in a hugging motion.",
      "Long Explanation": "The Cable Crossovers is a weight training exercise targeting the Chest. It involves using Cable machine with pulley system, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Cable+Crossovers"
    },
    {
      "Muscles": "Chest",
      "WorkOut": "Chest Press Machine",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Chest press machine",
      "Explaination": "Chest Press Machine: Sit on the machine, push the bars or handles forward, then bring them back towards the chest.",
      "Long Explanation": "The Chest Press Machine is a weight training exercise targeting the Chest. It involves using Chest press machine, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Chest+Press+Machine"
    },
    {
      "Muscles": "Chest",
      "WorkOut": "Pec Deck Machine",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Pec deck machine",
      "Explaination": "Pec Deck Machine: Sit with arms on the pads and bring them together in front of you.",
      "Long Explanation": "The Pec Deck Machine is a weight training exercise targeting the Chest. It involves using Pec deck machine, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Pec+Deck+Machine"
    },
    {
      "Muscles": "Chest",
      "WorkOut": "Dips for Chest",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Parallel bars",
      "Explaination": "Dips for Chest: Perform dips with a forward lean to emphasize the chest muscles.",
      "Long Explanation": "The Dips for Chest is a weight training exercise targeting the Chest. It involves using Parallel bars, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Dips+for+Chest"
    },
    {
      "Muscles": "Chest",
      "WorkOut": "Svend Press",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Plates or dumbbells",
      "Explaination": "Svend Press: Hold plates between your hands and press them together in front of your chest, then push forward.",
      "Long Explanation": "The Svend Press is a weight training exercise targeting the Chest. It involves using Plates or dumbbells, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Svend+Press"
    },
    {
      "Muscles": "Chest",
      "WorkOut": "Single-Arm Dumbbell Bench Press",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbell and bench",
      "Explaination": "Single-Arm Dumbbell Bench Press: Lie on a bench and press a dumbbell with one arm, alternating sides.",
      "Long Explanation": "The Single-Arm Dumbbell Bench Press is a weight training exercise targeting the Chest. It involves using Dumbbell and bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Single-Arm+Dumbbell+Bench+Press"
    },
    {
      "Muscles": "Chest",
      "WorkOut": "Floor Press",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell and bench",
      "Explaination": "Floor Press: Similar to a bench press but performed lying on the floor, limiting the range of motion.",
      "Long Explanation": "The Floor Press is a weight training exercise targeting the Chest. It involves using Barbell and bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Floor+Press"
    },
    {
      "Muscles": "Chest",
      "WorkOut": "Plyometric Push-Up",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Plyometric Push-Up: Explosive push-ups, where you push off the ground to lift your hands, then land back in a push-up.",
      "Long Explanation": "The Plyometric Push-Up is a weight training exercise targeting the Chest. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Plyometric+Push-Up"
    },
    {
      "Muscles": "Chest",
      "WorkOut": "Resistance Band Chest Press",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Resistance band",
      "Explaination": "Resistance Band Chest Press: Wrap a resistance band around your back and press forward as if bench pressing.",
      "Long Explanation": "The Resistance Band Chest Press is a weight training exercise targeting the Chest. It involves using Resistance band, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Resistance+Band+Chest+Press"
    },
    {
      "Muscles": "Chest",
      "WorkOut": "Staggered Push-Up",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Staggered Push-Up: Perform push-ups with one hand forward and the other back, alternating the position each rep.",
      "Long Explanation": "The Staggered Push-Up is a weight training exercise targeting the Chest. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Staggered+Push-Up"
    },
    {
      "Muscles": "Back",
      "WorkOut": "Deadlift",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell",
      "Explaination": "Deadlift: Lift a barbell or weights from the ground to hip level, keeping your back straight and driving with your legs.",
      "Long Explanation": "The Deadlift is a weight training exercise targeting the Back. It involves using Barbell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Deadlift"
    },
    {
      "Muscles": "Back",
      "WorkOut": "Pull-Ups",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Pull-up bar",
      "Explaination": "Pull-Ups: Grip a bar with palms facing away and pull your body up until your chin is over the bar.",
      "Long Explanation": "The Pull-Ups is a weight training exercise targeting the Back. It involves using Pull-up bar, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Pull-Ups"
    },
    {
      "Muscles": "Back",
      "WorkOut": "Bent-Over Barbell Row",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell",
      "Explaination": "Bent-Over Barbell Row: Bend at the waist, hold a barbell with both hands and pull it towards your lower chest or abdomen.",
      "Long Explanation": "The Bent-Over Barbell Row is a weight training exercise targeting the Back. It involves using Barbell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Bent-Over+Barbell+Row"
    },
    {
      "Muscles": "Back",
      "WorkOut": "Lat Pulldown",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Cable machine with lat pulldown bar",
      "Explaination": "Lat Pulldown: Sit at a lat pulldown machine, pull the bar down towards your chest while keeping your back straight.",
      "Long Explanation": "The Lat Pulldown is a weight training exercise targeting the Back. It involves using Cable machine with lat pulldown bar, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Lat+Pulldown"
    },
    {
      "Muscles": "Back",
      "WorkOut": "Seated Cable Row",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Cable machine",
      "Explaination": "Seated Cable Row: Sit at a cable row station, pull the handle towards your waist while keeping your back straight.",
      "Long Explanation": "The Seated Cable Row is a weight training exercise targeting the Back. It involves using Cable machine, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Seated+Cable+Row"
    },
    {
      "Muscles": "Back",
      "WorkOut": "Single-Arm Dumbbell Row",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbell",
      "Explaination": "Single-Arm Dumbbell Row: Bend over at the waist, use one hand to row a dumbbell, keeping your back parallel to the floor.",
      "Long Explanation": "The Single-Arm Dumbbell Row is a weight training exercise targeting the Back. It involves using Dumbbell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Single-Arm+Dumbbell+Row"
    },
    {
      "Muscles": "Back",
      "WorkOut": "T-Bar Row",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell and T-bar row machine or landmine attachment",
      "Explaination": "T-Bar Row: Straddle a barbell, lift it using a T-bar attachment or handle, keeping your back straight.",
      "Long Explanation": "The T-Bar Row is a weight training exercise targeting the Back. It involves using Barbell and T-bar row machine or landmine attachment, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=T-Bar+Row"
    },
    {
      "Muscles": "Back",
      "WorkOut": "Inverted Row",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Bar or Smith machine",
      "Explaination": "Inverted Row: Lie under a bar, pull your chest up to the bar with feet planted on the ground.",
      "Long Explanation": "The Inverted Row is a weight training exercise targeting the Back. It involves using Bar or Smith machine, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Inverted+Row"
    },
    {
      "Muscles": "Back",
      "WorkOut": "Back Extension",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Back extension bench",
      "Explaination": "Back Extension: Use a back extension bench to lift your upper body up and down, focusing on lower back muscles.",
      "Long Explanation": "The Back Extension is a weight training exercise targeting the Back. It involves using Back extension bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Back+Extension"
    },
    {
      "Muscles": "Back",
      "WorkOut": "Machine Row",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Rowing machine",
      "Explaination": "Machine Row: Sit at a row machine, pull the handles towards your torso, focusing on your middle back.",
      "Long Explanation": "The Machine Row is a weight training exercise targeting the Back. It involves using Rowing machine, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Machine+Row"
    },
    {
      "Muscles": "Back",
      "WorkOut": "Chin-Up",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Pull-up bar",
      "Explaination": "Chin-Up: Grip a bar with palms facing towards you and pull up until your chin is over the bar, focusing on your upper back.",
      "Long Explanation": "The Chin-Up is a weight training exercise targeting the Back. It involves using Pull-up bar, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Chin-Up"
    },
    {
      "Muscles": "Back",
      "WorkOut": "Renegade Row",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbells",
      "Explaination": "Renegade Row: In a plank position with dumbbells, row one dumbbell up while stabilizing your body with the other arm.",
      "Long Explanation": "The Renegade Row is a weight training exercise targeting the Back. It involves using Dumbbells, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Renegade+Row"
    },
    {
      "Muscles": "Back",
      "WorkOut": "Resistance Band Pull Apart",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Resistance band",
      "Explaination": "Resistance Band Pull Apart: Hold a resistance band in front of you and pull it apart horizontally, focusing on your rear shoulders and upper back.",
      "Long Explanation": "The Resistance Band Pull Apart is a weight training exercise targeting the Back. It involves using Resistance band, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Resistance+Band+Pull+Apart"
    },
    {
      "Muscles": "Back",
      "WorkOut": "Hyperextension",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Hyperextension bench",
      "Explaination": "Hyperextension: On a hyperextension bench, lift and lower your upper body, targeting your lower back.",
      "Long Explanation": "The Hyperextension is a weight training exercise targeting the Back. It involves using Hyperextension bench, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Hyperextension"
    },
    {
      "Muscles": "Back",
      "WorkOut": "Face Pull",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Cable machine with rope or handle attachment",
      "Explaination": "Face Pull: Use a cable machine with a rope attachment, pull towards your face while keeping your elbows high.",
      "Long Explanation": "The Face Pull is a weight training exercise targeting the Back. It involves using Cable machine with rope or handle attachment, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Face+Pull"
    },
    {
      "Muscles": "Legs",
      "WorkOut": "Squat",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell or dumbbells",
      "Explaination": "Squat: Stand with feet shoulder-width apart, bend knees to lower your body as if sitting back, then stand up.",
      "Long Explanation": "The Squat is a weight training exercise targeting the Legs. It involves using Barbell or dumbbells, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Squat"
    },
    {
      "Muscles": "Legs",
      "WorkOut": "Deadlift",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell",
      "Explaination": "Deadlift: Bend at your hips and knees to lower and grab a barbell, then stand up, lifting the weight.",
      "Long Explanation": "The Deadlift is a weight training exercise targeting the Legs. It involves using Barbell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Deadlift"
    },
    {
      "Muscles": "Legs",
      "WorkOut": "Lunges",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbells",
      "Explaination": "Lunges: Step forward with one foot and lower your body until both knees are bent at 90 degrees.",
      "Long Explanation": "The Lunges is a weight training exercise targeting the Legs. It involves using Dumbbells, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Lunges"
    },
    {
      "Muscles": "Legs",
      "WorkOut": "Leg Press",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Leg press machine",
      "Explaination": "Leg Press: Sit in a leg press machine, push the weighted platform away, then return to the starting position.",
      "Long Explanation": "The Leg Press is a weight training exercise targeting the Legs. It involves using Leg press machine, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Leg+Press"
    },
    {
      "Muscles": "Legs",
      "WorkOut": "Bulgarian Split Squat",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbell and a bench or platform",
      "Explaination": "Bulgarian Split Squat: Perform a lunge with your rear foot elevated on a bench or platform.",
      "Long Explanation": "The Bulgarian Split Squat is a weight training exercise targeting the Legs. It involves using Dumbbell and a bench or platform, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Bulgarian+Split+Squat"
    },
    {
      "Muscles": "Legs",
      "WorkOut": "Step-Up",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Bench or platform",
      "Explaination": "Step-Up: Step up onto a bench or platform with one foot, then step back down and repeat with the other foot.",
      "Long Explanation": "The Step-Up is a weight training exercise targeting the Legs. It involves using Bench or platform, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Step-Up"
    },
    {
      "Muscles": "Legs",
      "WorkOut": "Calf Raises",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Calf Raises: Stand on the edge of a step or platform and raise and lower your heels, working the calf muscles.",
      "Long Explanation": "The Calf Raises is a weight training exercise targeting the Legs. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Calf+Raises"
    },
    {
      "Muscles": "Legs",
      "WorkOut": "Romanian Deadlift",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell",
      "Explaination": "Romanian Deadlift: Hold a barbell or dumbbells, bend at your hips, and lower your torso, keeping your legs straight.",
      "Long Explanation": "The Romanian Deadlift is a weight training exercise targeting the Legs. It involves using Barbell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Romanian+Deadlift"
    },
    {
      "Muscles": "Legs",
      "WorkOut": "Leg Extension",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Leg extension machine",
      "Explaination": "Leg Extension: Sit on a leg extension machine and extend your legs against resistance, then return to the start.",
      "Long Explanation": "The Leg Extension is a weight training exercise targeting the Legs. It involves using Leg extension machine, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Leg+Extension"
    },
    {
      "Muscles": "Legs",
      "WorkOut": "Leg Curl",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Leg curl machine",
      "Explaination": "Leg Curl: Lie or sit on a leg curl machine and curl your legs towards your buttocks against resistance.",
      "Long Explanation": "The Leg Curl is a weight training exercise targeting the Legs. It involves using Leg curl machine, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Leg+Curl"
    },
    {
      "Muscles": "Legs",
      "WorkOut": "Hack Squat",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Hack squat machine",
      "Explaination": "Hack Squat: Use a hack squat machine, squat down while keeping your back against the pad, then stand back up.",
      "Long Explanation": "The Hack Squat is a weight training exercise targeting the Legs. It involves using Hack squat machine, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Hack+Squat"
    },
    {
      "Muscles": "Legs",
      "WorkOut": "Goblet Squat",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbell or kettlebell",
      "Explaination": "Goblet Squat: Hold a kettlebell or dumbbell at your chest, squat down while keeping your back straight.",
      "Long Explanation": "The Goblet Squat is a weight training exercise targeting the Legs. It involves using Dumbbell or kettlebell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Goblet+Squat"
    },
    {
      "Muscles": "Legs",
      "WorkOut": "Box Jump",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Box or sturdy platform",
      "Explaination": "Box Jump: Stand in front of a box or platform and jump onto it with both feet, then step back down.",
      "Long Explanation": "The Box Jump is a weight training exercise targeting the Legs. It involves using Box or sturdy platform, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Box+Jump"
    },
    {
      "Muscles": "Legs",
      "WorkOut": "Glute Bridge",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Glute Bridge: Lie on your back with knees bent, lift your hips while squeezing your glutes, then lower back down.",
      "Long Explanation": "The Glute Bridge is a weight training exercise targeting the Legs. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Glute+Bridge"
    },
    {
      "Muscles": "Legs",
      "WorkOut": "Stiff-Legged Deadlift",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell",
      "Explaination": "Stiff-Legged Deadlift: Similar to the Romanian deadlift, but with legs kept rigid and straight throughout the movement.",
      "Long Explanation": "The Stiff-Legged Deadlift is a weight training exercise targeting the Legs. It involves using Barbell, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Stiff-Legged+Deadlift"
    },
    {
      "Muscles": "Abs",
      "WorkOut": "Plank",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Maintain a push-up position, keeping your body straight and holding the position to engage your entire core.",
      "Long Explanation": "The Plank is a weight training exercise targeting the Abs. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Plank"
    },
    {
      "Muscles": "Abs",
      "WorkOut": "Crunches",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Lie on your back, knees bent, lift your shoulders off the floor using your core muscles.",
      "Long Explanation": "The Crunches is a weight training exercise targeting the Abs. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Crunches"
    },
    {
      "Muscles": "Abs",
      "WorkOut": "Bicycle Crunches",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Lie on your back, alternate bringing your elbow to the opposite knee, mimicking a cycling motion.",
      "Long Explanation": "The Bicycle Crunches is a weight training exercise targeting the Abs. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Bicycle+Crunches"
    },
    {
      "Muscles": "Abs",
      "WorkOut": "Russian Twists",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Pull-up bar or sturdy bar",
      "Explaination": "Sit on the floor, lean back slightly, and twist your torso from side to side with or without a weight.",
      "Long Explanation": "The Russian Twists is a weight training exercise targeting the Abs. It involves using Pull-up bar or sturdy bar, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Russian+Twists"
    },
    {
      "Muscles": "Abs",
      "WorkOut": "Hanging Leg Raises",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Hang from a pull-up bar and raise your legs to hip level, keeping them straight or bending knees.",
      "Long Explanation": "The Hanging Leg Raises is a weight training exercise targeting the Abs. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Hanging+Leg+Raises"
    },
    {
      "Muscles": "Abs",
      "WorkOut": "Mountain Climbers",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Start in a plank position, then alternate bringing your knees towards your chest rapidly.",
      "Long Explanation": "The Mountain Climbers is a weight training exercise targeting the Abs. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Mountain+Climbers"
    },
    {
      "Muscles": "Abs",
      "WorkOut": "Reverse Crunches",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Lie on your back and lift your hips off the ground, bringing your knees towards your chest.",
      "Long Explanation": "The Reverse Crunches is a weight training exercise targeting the Abs. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Reverse+Crunches"
    },
    {
      "Muscles": "Abs",
      "WorkOut": "Leg Raises",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Ab roller",
      "Explaination": "Lie on your back, keep your legs straight, and lift them up towards the ceiling, then lower them without touching the floor.",
      "Long Explanation": "The Leg Raises is a weight training exercise targeting the Abs. It involves using Ab roller, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Leg+Raises"
    },
    {
      "Muscles": "Abs",
      "WorkOut": "V-Ups",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Lie on your back, simultaneously lift your legs and torso, reaching for your toes.",
      "Long Explanation": "The V-Ups is a weight training exercise targeting the Abs. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=V-Ups"
    },
    {
      "Muscles": "Abs",
      "WorkOut": "Ab Roller",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Use an ab roller to roll forward from your knees or toes, then roll back, engaging your core.",
      "Long Explanation": "The Ab Roller is a weight training exercise targeting the Abs. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Ab+Roller"
    },
    {
      "Muscles": "Abs",
      "WorkOut": "Toe Touches",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Cable machine with rope or handle attachment",
      "Explaination": "Lie on your back with legs extended upward, reach towards your toes with your hands.",
      "Long Explanation": "The Toe Touches is a weight training exercise targeting the Abs. It involves using Cable machine with rope or handle attachment, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Toe+Touches"
    },
    {
      "Muscles": "Abs",
      "WorkOut": "Flutter Kicks",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Lie on your back, lift your legs slightly off the ground, and make small, quick up-and-down scissor-like motions.",
      "Long Explanation": "The Flutter Kicks is a weight training exercise targeting the Abs. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Flutter+Kicks"
    },
    {
      "Muscles": "Abs",
      "WorkOut": "Cable Woodchoppers",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Use a cable machine, stand and twist your torso, pulling the cable diagonally across your body.",
      "Long Explanation": "The Cable Woodchoppers is a weight training exercise targeting the Abs. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Cable+Woodchoppers"
    },
    {
      "Muscles": "Abs",
      "WorkOut": "Plank Jacks",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Start in a plank position, jump your feet in and out like a jumping jack.",
      "Long Explanation": "The Plank Jacks is a weight training exercise targeting the Abs. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Plank+Jacks"
    },
    {
      "Muscles": "Abs",
      "WorkOut": "Side Plank",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Lie on your side, lift your body so that you are supported by your forearm and feet, hold the position to work the obliques.",
      "Long Explanation": "The Side Plank is a weight training exercise targeting the Abs. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Side+Plank"
    },
    {
      "Muscles": "Stretching",
      "WorkOut": "Hamstring Stretch",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Quadriceps Stretch: While standing, pull one foot back towards your glutes, holding your ankle. Hold for 15-30 seconds and switch legs.",
      "Long Explanation": "The Hamstring Stretch is a weight training exercise targeting the Stretching. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Hamstring+Stretch"
    },
    {
      "Muscles": "Stretching",
      "WorkOut": "Quadriceps Stretch",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Calf Stretch: Place your hands on a wall and extend one leg back, keeping your heel on the ground. Lean forward slightly. Hold for 15-30 seconds and switch legs.",
      "Long Explanation": "The Quadriceps Stretch is a weight training exercise targeting the Stretching. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Quadriceps+Stretch"
    },
    {
      "Muscles": "Stretching",
      "WorkOut": "Calf Stretch",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Shoulder Stretch: Bring one arm across your body and use the other arm to press it closer. Hold for 15-30 seconds and switch arms.",
      "Long Explanation": "The Calf Stretch is a weight training exercise targeting the Stretching. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Calf+Stretch"
    },
    {
      "Muscles": "Stretching",
      "WorkOut": "Shoulder Stretch",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Triceps Stretch: Raise one arm, bend it so that your hand reaches towards the opposite shoulder blade. Use your other hand to press the elbow gently. Hold for 15-30 seconds and switch arms.",
      "Long Explanation": "The Shoulder Stretch is a weight training exercise targeting the Stretching. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Shoulder+Stretch"
    },
    {
      "Muscles": "Stretching",
      "WorkOut": "Triceps Stretch",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Chest Stretch: Interlace your fingers behind your back, straighten your arms and lift them slightly while expanding your chest.",
      "Long Explanation": "The Triceps Stretch is a weight training exercise targeting the Stretching. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Triceps+Stretch"
    },
    {
      "Muscles": "Stretching",
      "WorkOut": "Chest Stretch",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Hip Flexor Stretch: Kneel on one knee (cushion for comfort), with the other foot in front, forming a 90-degree angle. Push your hips forward.",
      "Long Explanation": "The Chest Stretch is a weight training exercise targeting the Stretching. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Chest+Stretch"
    },
    {
      "Muscles": "Stretching",
      "WorkOut": "Hip Flexor Stretch",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Butterfly Stretch: Sit down, press the soles of your feet together, and push your knees towards the ground.",
      "Long Explanation": "The Hip Flexor Stretch is a weight training exercise targeting the Stretching. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Hip+Flexor+Stretch"
    },
    {
      "Muscles": "Stretching",
      "WorkOut": "Butterfly Stretch",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Seated Hamstring Stretch: Sit on the ground and extend your legs forward. Reach towards your toes.",
      "Long Explanation": "The Butterfly Stretch is a weight training exercise targeting the Stretching. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Butterfly+Stretch"
    },
    {
      "Muscles": "Stretching",
      "WorkOut": "Seated Hamstring Stretch",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Spinal Twist: Sit on the ground with legs extended. Cross one leg over the other and twist your torso, pushing against your knee.",
      "Long Explanation": "The Seated Hamstring Stretch is a weight training exercise targeting the Stretching. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Seated+Hamstring+Stretch"
    },
    {
      "Muscles": "Stretching",
      "WorkOut": "Spinal Twist",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Cat-Cow Stretch: On hands and knees, alternate between arching your back towards the ceiling (cat) and dipping it towards the floor (cow).",
      "Long Explanation": "The Spinal Twist is a weight training exercise targeting the Stretching. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Spinal+Twist"
    },
    {
      "Muscles": "Stretching",
      "WorkOut": "Cat-Cow Stretch",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Child's Pose: Kneel and sit on your heels, then lean forward with arms extended in front to stretch your back.",
      "Long Explanation": "The Cat-Cow Stretch is a weight training exercise targeting the Stretching. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Cat-Cow+Stretch"
    },
    {
      "Muscles": "Stretching",
      "WorkOut": "Child's Pose",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Lying Quad Stretch: Lie on one side, pull your top legs ankle toward your glutes.",
      "Long Explanation": "The Child's Pose is a weight training exercise targeting the Stretching. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Child's+Pose"
    },
    {
      "Muscles": "Stretching",
      "WorkOut": "Lying Quad Stretch",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Lying Figure-4 Stretch: Lie on your back, cross one ankle over the opposite knee, and gently pull the uncrossed leg towards you.",
      "Long Explanation": "The Lying Quad Stretch is a weight training exercise targeting the Stretching. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Lying+Quad+Stretch"
    },
    {
      "Muscles": "Stretching",
      "WorkOut": "Lying Figure-4 Stretch",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Neck Stretch: Gently tilt your head towards each shoulder and hold for a few seconds.",
      "Long Explanation": "The Lying Figure-4 Stretch is a weight training exercise targeting the Stretching. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Lying+Figure-4+Stretch"
    },
    {
      "Muscles": "Stretching",
      "WorkOut": "Neck Stretch",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Gently tilt your head towards each shoulder, holding the stretch for a few seconds to relieve tension and improve flexibility in the neck muscles. Avoid forcing the movement and keep the stretch comfortable.",
      "Long Explanation": "The Neck Stretch is a weight training exercise targeting the Stretching. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Neck+Stretch"
    },
    {
      "Muscles": "Warm Up",
      "WorkOut": "Jogging in Place",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Jogging in Place: A simple way to elevate your heart rate.",
      "Long Explanation": "The Jogging in Place is a weight training exercise targeting the Warm Up. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Jogging+in+Place"
    },
    {
      "Muscles": "Warm Up",
      "WorkOut": "Jumping Jacks",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Jumping Jacks: A full-body movement that increases your heart rate and warms up your muscles.",
      "Long Explanation": "The Jumping Jacks is a weight training exercise targeting the Warm Up. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Jumping+Jacks"
    },
    {
      "Muscles": "Warm Up",
      "WorkOut": "Arm Circles",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Arm Circles: Great for warming up shoulders and arms.",
      "Long Explanation": "The Arm Circles is a weight training exercise targeting the Warm Up. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Arm+Circles"
    },
    {
      "Muscles": "Warm Up",
      "WorkOut": "High Knees",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "High Knees: Helps to increase heart rate and warm up leg muscles.",
      "Long Explanation": "The High Knees is a weight training exercise targeting the Warm Up. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=High+Knees"
    },
    {
      "Muscles": "Warm Up",
      "WorkOut": "Butt Kicks",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Butt Kicks: Run in place while kicking your heels up towards your glutes.",
      "Long Explanation": "The Butt Kicks is a weight training exercise targeting the Warm Up. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Butt+Kicks"
    },
    {
      "Muscles": "Warm Up",
      "WorkOut": "Leg Swings",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Leg Swings: Swing each leg back and forth, warming up your hip flexors and hamstrings.",
      "Long Explanation": "The Leg Swings is a weight training exercise targeting the Warm Up. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Leg+Swings"
    },
    {
      "Muscles": "Warm Up",
      "WorkOut": "Torso Twists",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Torso Twists: Stand with feet hip-width apart and twist your torso from side to side.",
      "Long Explanation": "The Torso Twists is a weight training exercise targeting the Warm Up. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Torso+Twists"
    },
    {
      "Muscles": "Warm Up",
      "WorkOut": "Side Lunges",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Side Lunges: Step out to the side and lunge, then switch sides. Great for warming up the inner thighs and glutes.",
      "Long Explanation": "The Side Lunges is a weight training exercise targeting the Warm Up. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Side+Lunges"
    },
    {
      "Muscles": "Warm Up",
      "WorkOut": "Hip Circles",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Hip Circles: Rotate your hips in large circles to loosen up the hip area.",
      "Long Explanation": "The Hip Circles is a weight training exercise targeting the Warm Up. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Hip+Circles"
    },
    {
      "Muscles": "Warm Up",
      "WorkOut": "Arm Swings",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Arm Swings: Swing your arms back and forth across your body to loosen up your chest and back.",
      "Long Explanation": "The Arm Swings is a weight training exercise targeting the Warm Up. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Arm+Swings"
    },
    {
      "Muscles": "Warm Up",
      "WorkOut": "Dynamic Stretching (e.g., Lunges with a Twist)",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Dynamic Stretching (e.g., Lunges with a Twist): Incorporating movement with stretching to warm up the body.",
      "Long Explanation": "The Dynamic Stretching (e.g., Lunges with a Twist) is a weight training exercise targeting the Warm Up. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Dynamic+Stretching+(e.g.,+Lunges+with+a+Twist)"
    },
    {
      "Muscles": "Warm Up",
      "WorkOut": "Inchworms",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Inchworms: Stand, bend at the waist, walk your hands out to a plank, then walk feet towards hands.",
      "Long Explanation": "The Inchworms is a weight training exercise targeting the Warm Up. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Inchworms"
    },
    {
      "Muscles": "Warm Up",
      "WorkOut": "Jump Rope",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Jump Rope: A good cardiovascular exercise to get the blood flowing.",
      "Long Explanation": "The Jump Rope is a weight training exercise targeting the Warm Up. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Jump+Rope"
    },
    {
      "Muscles": "Warm Up",
      "WorkOut": "Shadow Boxing",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Shadow Boxing: Throw punches in the air, warming up your upper body and increasing heart rate.",
      "Long Explanation": "The Shadow Boxing is a weight training exercise targeting the Warm Up. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Shadow+Boxing"
    },
    {
      "Muscles": "Warm Up",
      "WorkOut": "Mountain Climbers",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Mountain Climbers: A dynamic exercise that increases heart rate and warms up the whole body.",
      "Long Explanation": "The Mountain Climbers is a weight training exercise targeting the Warm Up. It involves using nan, focusing on the form and technique to effectively engage the muscles. Ideal for strength building and muscle definition, it's important to maintain controlled movements throughout.",
      "Video": "https://www.youtube.com/results?search_query=Mountain+Climbers"
    },
    {
      "Muscles": "Lats",
      "WorkOut": "Lat Pulldowns",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Cable machine",
      "Explaination": "Strengthens the latissimus dorsi muscle, improving upper body strength and posture.",
      "Long Explanation": "Pull down a wide bar attached to a cable machine.    Sit down at a cable machine with a wide bar attached. Adjust the knee pad to fit snugly. Grab the bar with a wide grip, and while keeping your back straight, pull the bar down to your chest. Slowly return to the starting position, feeling the stretch in your lats.",
      "Video": "https://www.youtube.com/results?search_query=Lat+Pulldowns"
    },
    {
      "Muscles": "Lats",
      "WorkOut": "Pull-Ups",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Pull-up bar",
      "Explaination": "Enhances upper body strength, particularly in the back, shoulders, and arms.",
      "Long Explanation": "Lift your body up on a pull-up bar using your arms.    Stand beneath a pull-up bar and grab it with a grip slightly wider than shoulder-width. Hang from the bar with your arms extended. Pull yourself up by bending your elbows while squeezing your shoulder blades together, until your chin is over the bar. Lower yourself back down to the starting position in a controlled manner.",
      "Video": "https://www.youtube.com/results?search_query=Pull-Ups"
    },
    {
      "Muscles": "Lats",
      "WorkOut": "Barbell Rows",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Targets multiple back muscles, improving overall back strength and thickness.",
      "Long Explanation": "Bend over and pull a barbell towards your waist.    Stand with your feet shoulder-width apart holding a barbell. Bend your knees slightly and hinge forward from your hips, keeping your back straight. Pull the barbell towards your lower chest, retracting your shoulder blades as you lift. Lower the barbell back down in a controlled motion.",
      "Video": "https://www.youtube.com/results?search_query=Barbell+Rows"
    },
    {
      "Muscles": "Lats",
      "WorkOut": "Single-Arm Dumbbell Rows",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell",
      "Explaination": "Isolates one side of the body at a time, improving muscular balance and core stability.",
      "Long Explanation": "Lift a dumbbell with one arm while leaning on a bench.    Place one knee and the same-side hand on a bench for support. Hold a dumbbell in your free hand with your arm extended. Pull the dumbbell upwards towards your torso, keeping your back straight and your torso still. Lower the dumbbell back to the starting position.",
      "Video": "https://www.youtube.com/results?search_query=Single-Arm+Dumbbell+Rows"
    },
    {
      "Muscles": "Lats",
      "WorkOut": "Straight-Arm Pulldowns",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbell",
      "Explaination": "Primarily targets the lats, helping in developing back width.",
      "Long Explanation": "Pull a cable bar down while keeping your arms straight.    Stand in front of a cable machine with a bar attached at the high setting. Grasp the bar with both hands, arms extended. Keeping your arms straight, pull the bar down towards your thighs by contracting your lats. Slowly return to the starting position.",
      "Video": "https://www.youtube.com/results?search_query=Straight-Arm+Pulldowns"
    },
    {
      "Muscles": "Lats",
      "WorkOut": "Kneeling Lat Pushdowns",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Cable machine",
      "Explaination": "Focuses on the lat muscles, enhancing upper body muscular definition.",
      "Long Explanation": "Kneel and push down a bar attached to a cable machine.    Kneel in front of a cable machine with a bar attached at the top setting. Grasp the bar with an overhand grip, arms extended. Keeping your arms straight, push the bar down towards your thighs, engaging your lats. Slowly return to the starting position.",
      "Video": "https://www.youtube.com/results?search_query=Kneeling+Lat+Pushdowns"
    },
    {
      "Muscles": "Lats",
      "WorkOut": "Underhand Cable Pulldowns",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Lat pulldown machine",
      "Explaination": "Engages the biceps more than overhand grips, strengthening both lats and arms.",
      "Long Explanation": "Pull down an underhand grip bar attached to a cable machine.    Sit at a cable machine with a bar attached. Use an underhand grip to hold the bar, and while keeping your back straight, pull the bar down to your chest. Focus on using your lats to pull, and then slowly return to the starting position.",
      "Video": "https://www.youtube.com/results?search_query=Underhand+Cable+Pulldowns"
    },
    {
      "Muscles": "Lats",
      "WorkOut": "Wide-Grip Lat Pulldowns",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Cable machine",
      "Explaination": "Targets the outer lats, aiding in developing a wider back.",
      "Long Explanation": "Pull down a wide-grip bar attached to a cable machine.    Sit at a cable machine with a wide-grip bar attached. Grab the bar with a wide grip, and while keeping your back straight, pull the bar down towards your chest. Ensure your lats are engaged throughout the movement and then slowly return to the starting position.",
      "Video": "https://www.youtube.com/results?search_query=Wide-Grip+Lat+Pulldowns"
    },
    {
      "Muscles": "Lats",
      "WorkOut": "V-Bar Pulldown",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Cable machine",
      "Explaination": "Engages the middle back muscles, aiding in overall back development.",
      "Long Explanation": "Pull down a V-bar attached to a cable machine.    Sit at a cable machine with a V-bar attachment. Hold the V-bar with both hands and pull it down towards your chest, keeping your back straight. Focus on engaging your lats and then slowly return to the starting position.",
      "Video": "https://www.youtube.com/results?search_query=V-Bar+Pulldown"
    },
    {
      "Muscles": "Lats",
      "WorkOut": "Lat Pull-In",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Cable machine",
      "Explaination": "Strengthens the core and lats, improving functional and athletic performance.",
      "Long Explanation": "Pull a cable in towards your waist.    Stand facing a cable machine with the cable set at waist height. Grasp the handle with both hands and pull it towards your waist, keeping your arms straight. Engage your lats and core throughout the movement, then slowly return to the starting position.",
      "Video": "https://www.youtube.com/results?search_query=Lat+Pull-In"
    },
    {
      "Muscles": "Lats",
      "WorkOut": "Decline Dumbbell Pullover",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Cable machine",
      "Explaination": "Works on the chest and lats, increasing upper body flexibility and strength.",
      "Long Explanation": "Lie back and pull a dumbbell over your head.    Lie on a bench holding a dumbbell with both hands above your chest. Keeping your arms slightly bent, lower the dumbbell back and over your head until your arms are parallel with the bench. Engage your lats and chest to pull the dumbbell back to the starting position.",
      "Video": "https://www.youtube.com/results?search_query=Decline+Dumbbell+Pullover"
    },
    {
      "Muscles": "Lats",
      "WorkOut": "Machine High Row",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbell",
      "Explaination": "Targets the upper and middle back muscles, improving back muscle balance.",
      "Long Explanation": "Pull a bar down on a machine designed for rows.    Sit at a high row machine, grabbing the handles. Pull the handles towards your upper abdomen, squeezing your shoulder blades together. Keep your back straight and avoid leaning back too far. Slowly return to the starting position.",
      "Video": "https://www.youtube.com/results?search_query=Machine+High+Row"
    },
    {
      "Muscles": "Lats",
      "WorkOut": "Inverted Row",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Cable machine or rowing machine",
      "Explaination": "Strengthens the back, shoulders, and arms, and is a good alternative to pull-ups.",
      "Long Explanation": "Pull yourself up to a bar in an inverted position.    Set a bar at waist height on a Smith machine or squat rack. Lie underneath the bar, and grab it with an overhand grip. Pull your chest up to the bar while keeping your body straight, then lower yourself back down.",
      "Video": "https://www.youtube.com/results?search_query=Inverted+Row"
    },
    {
      "Muscles": "Lats",
      "WorkOut": "Rack Pulls",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Focuses on the upper portion of deadlifts, strengthening the lower back and traps.",
      "Long Explanation": "Lift a barbell off a rack or blocks to your thighs.    Load a barbell on a power rack or blocks at knee height. Stand with your feet shoulder-width apart and grip the bar. Lift the bar by straightening your legs and hips, keeping your back straight. Lower the bar back down to the starting position.",
      "Video": "https://www.youtube.com/results?search_query=Rack+Pulls"
    },
    {
      "Muscles": "Lats",
      "WorkOut": "Landmine Row",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell",
      "Explaination": "A full-body exercise that targets the back, shoulders, and core.",
      "Long Explanation": "Stand beside a barbell and pull it across your body.    Stand next to one end of a barbell secured in a landmine attachment. Hold the barbell with both hands and pull it upwards and across your body, rotating your torso. Keep your arms slightly bent and engage your core. Lower the barbell back down in a controlled motion.",
      "Video": "https://www.youtube.com/results?search_query=Landmine+Row"
    },
    {
      "Muscles": "Hamstring",
      "WorkOut": "Romanian Deadlift",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell",
      "Explaination": "Strengthens the hamstrings, glutes, and lower back, improving posterior chain strength.",
      "Long Explanation": "Lift a barbell with your hips while keeping your back straight.    Stand with your feet hip-width apart, a barbell in front of your feet. Bend at the hips and knees to grab the barbell with an overhand grip. Keep your back straight and lift the barbell by extending your hips and standing up. Lower the barbell back to the ground in a controlled motion.",
      "Video": "https://www.youtube.com/results?search_query=Romanian+Deadlift"
    },
    {
      "Muscles": "Hamstring",
      "WorkOut": "Leg Curls",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Isolates hamstrings, crucial for leg strength, stability, and injury prevention.",
      "Long Explanation": "Lie on a bench and curl your legs upwards.    Lie face down on a leg curl machine with the pad of the lever on the back of your legs. Curl your legs up towards your buttocks by flexing the knees, then lower back to the starting position.",
      "Video": "https://www.youtube.com/results?search_query=Leg+Curls"
    },
    {
      "Muscles": "Hamstring",
      "WorkOut": "Stiff-Legged Deadlift",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Leg curl machine",
      "Explaination": "Strengthens the hamstrings and lower back, enhancing deadlift performance.",
      "Long Explanation": "Stand with a barbell and lift it while keeping your legs straight.    Stand with your feet shoulder-width apart, holding a barbell in front of your thighs. Keeping your legs straight, bend at the waist and lower the barbell towards the floor, then lift it back up.",
      "Video": "https://www.youtube.com/results?search_query=Stiff-Legged+Deadlift"
    },
    {
      "Muscles": "Hamstring",
      "WorkOut": "Good Mornings",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell",
      "Explaination": "Strengthens the lower back, hamstrings, and glutes, and improves hip mobility.",
      "Long Explanation": "Bend forward with a barbell on your shoulders.    Stand with your feet shoulder-width apart, holding a barbell on your shoulders. Bend forward at your hips while keeping your back straight, then return to the upright position.",
      "Video": "https://www.youtube.com/results?search_query=Good+Mornings"
    },
    {
      "Muscles": "Hamstring",
      "WorkOut": "Nordic Hamstring Curls",
      "Intensity_Level": "Expert",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell or weight plate",
      "Explaination": "Prevents hamstring injuries and improves strength in the back of the leg.",
      "Long Explanation": "Kneel and fall forward, catching yourself with your hands.    Kneel on the ground with your feet held down. Fall forward and catch yourself with your hands, then use your hamstrings to pull yourself back to the kneeling position.",
      "Video": "https://www.youtube.com/results?search_query=Nordic+Hamstring+Curls"
    },
    {
      "Muscles": "Hamstring",
      "WorkOut": "Single-Leg Deadlift",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Bodyweight",
      "Explaination": "Improves balance, core stability, and strength in the hamstrings and glutes.",
      "Long Explanation": "Lift a weight with one leg while keeping the other leg straight.    Stand holding a weight in one hand with the opposite leg planted on the ground. Bend your knee and hip to lower the weight towards the ground while keeping the other leg straight.",
      "Video": "https://www.youtube.com/results?search_query=Single-Leg+Deadlift"
    },
    {
      "Muscles": "Hamstring",
      "WorkOut": "Dumbbell Leg Curls",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbell",
      "Explaination": "Isolates the hamstrings, offering a balanced leg workout.",
      "Long Explanation": "Lie on a bench and curl your legs upwards holding a dumbbell.    Lie face down on a bench holding a dumbbell between your feet. Curl your legs up towards your buttocks, then lower them back to the starting position.",
      "Video": "https://www.youtube.com/results?search_query=Dumbbell+Leg+Curls"
    },
    {
      "Muscles": "Hamstring",
      "WorkOut": "Glute-Ham Raise",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Leg curl machine",
      "Explaination": "Strengthens the entire posterior chain, including glutes, hamstrings, and lower back.",
      "Long Explanation": "Lift your body using your glutes and hamstrings.    Position yourself on a glute-ham developer machine with your feet secured. Bend at the hips to lower your torso towards the ground, then use your glutes and hamstrings to return to the starting position.",
      "Video": "https://www.youtube.com/results?search_query=Glute-Ham+Raise"
    },
    {
      "Muscles": "Hamstring",
      "WorkOut": "Swiss Ball Hamstring Curl",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Bodyweight",
      "Explaination": "Improves hamstring strength, core stability, and balance.",
      "Long Explanation": "Lie on a ball and curl your legs towards your buttocks.    Lie face down on an exercise ball with your hands on the ground. Curl your legs towards your buttocks by flexing your knees, then lower back to the starting position.",
      "Video": "https://www.youtube.com/results?search_query=Swiss+Ball+Hamstring+Curl"
    },
    {
      "Muscles": "Hamstring",
      "WorkOut": "Kettlebell Swing",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Exercise ball",
      "Explaination": "Enhances power, strength, and endurance in the glutes, hamstrings, and core.",
      "Long Explanation": "Swing a kettlebell up to chest height.    Stand with your feet shoulder-width apart holding a kettlebell between your legs. Swing the kettlebell up to chest height by extending your hips and knees, then let it swing back between your legs.",
      "Video": "https://www.youtube.com/results?search_query=Kettlebell+Swing"
    },
    {
      "Muscles": "Hamstring",
      "WorkOut": "Cable Pull Through",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Kettlebell",
      "Explaination": "Strengthens the posterior chain, particularly the hamstrings and glutes.",
      "Long Explanation": "Stand with a cable machine and pull through your legs.    Stand facing away from a cable machine with the cable between your legs. Bend at the hips and reach through your legs to grab the cable, then stand up straight and extend your hips.",
      "Video": "https://www.youtube.com/results?search_query=Cable+Pull+Through"
    },
    {
      "Muscles": "Hamstring",
      "WorkOut": "Resistance Band Leg Curl",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Cable machine",
      "Explaination": "Offers a versatile way to strengthen the hamstrings with variable resistance.",
      "Long Explanation": "Sit or stand and curl your legs with a resistance band.    Attach a resistance band to a low anchor point and loop it around your ankles. Sit or stand and curl your legs towards your buttocks against the resistance of the band.",
      "Video": "https://www.youtube.com/results?search_query=Resistance+Band+Leg+Curl"
    },
    {
      "Muscles": "Hamstring",
      "WorkOut": "Slider Leg Curl",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Resistance band",
      "Explaination": "Strengthens the hamstrings and increases core engagement and stability.",
      "Long Explanation": "Slide your feet on a towel or sliders and curl your legs.    Lie on your back with your feet on furniture sliders or a towel. Slide your feet towards your buttocks by bending your knees, then slide them back out.",
      "Video": "https://www.youtube.com/results?search_query=Slider+Leg+Curl"
    },
    {
      "Muscles": "Hamstring",
      "WorkOut": "Bulgarian Split Squat",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Furniture slider or towel",
      "Explaination": "Improves strength and balance in the legs and glutes, with a focus on each leg individually.",
      "Long Explanation": "Do a lunge with one leg elevated behind you.    Stand about two feet in front of a bench or platform. Place one foot on the bench and lower your body by bending your front knee, then stand back up.",
      "Video": "https://www.youtube.com/results?search_query=Bulgarian+Split+Squat"
    },
    {
      "Muscles": "Hamstring",
      "WorkOut": "Box Squat",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbell and bench or platform",
      "Explaination": "Builds power in the lower body, particularly the glutes and quadriceps.",
      "Long Explanation": "Squat while holding a weight and then jump onto a box.    Stand in front of a box holding a weight. Squat down, then explosively jump up onto the box. Step back down and repeat.",
      "Video": "https://www.youtube.com/results?search_query=Box+Squat"
    },
    {
      "Muscles": "Calves",
      "WorkOut": "Standing Calf Raise",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Box or platform",
      "Explaination": "Increases calf muscle size and strength, essential for lower leg aesthetics and function.",
      "Long Explanation": "Raise your heels while standing.    Stand on a step or platform with your heels hanging off the edge. Raise your heels as high as possible, then lower them back down.",
      "Video": "https://www.youtube.com/results?search_query=Standing+Calf+Raise"
    },
    {
      "Muscles": "Calves",
      "WorkOut": "Seated Calf Raise",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Calf raise machine",
      "Explaination": "Targets the soleus muscle in the calves, crucial for calf development.",
      "Long Explanation": "Raise your heels while sitting.    Sit on a weight bench with a weight on your knees. Raise your heels as high as possible, then lower them back down.",
      "Video": "https://www.youtube.com/results?search_query=Seated+Calf+Raise"
    },
    {
      "Muscles": "Calves",
      "WorkOut": "Calf Press On Leg Machine",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Weight bench",
      "Explaination": "Strengthens the calves, enhancing lower leg power and stability.",
      "Long Explanation": "Press with your feet on a leg press machine.    Sit on a leg press machine with your feet on the platform. Push the platform away from you by extending your knees, then return to the starting position.",
      "Video": "https://www.youtube.com/results?search_query=Calf+Press+On+Leg+Machine"
    },
    {
      "Muscles": "Calves",
      "WorkOut": "Single-Leg Calf Raise",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Leg press machine",
      "Explaination": "Isolates each calf, improving muscular balance and ankle stability.",
      "Long Explanation": "Raise one heel while standing.    Stand on one leg with your heel hanging off a step or platform. Raise your heel as high as possible, then lower it back down.",
      "Video": "https://www.youtube.com/results?search_query=Single-Leg+Calf+Raise"
    },
    {
      "Muscles": "Calves",
      "WorkOut": "Box Jumps",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Bodyweight",
      "Explaination": "Enhances explosive power, coordination, and calf strength.",
      "Long Explanation": "Jump repeatedly for a set amount of time.    Stand with your feet shoulder-width apart. Bend your knees and jump up, landing softly and immediately jumping again.",
      "Video": "https://www.youtube.com/results?search_query=Box+Jumps"
    },
    {
      "Muscles": "Calves",
      "WorkOut": "Farmers Walk on Toes",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Box or platform",
      "Explaination": "Builds calf strength and improves overall stability and grip strength.",
      "Long Explanation": "Walk holding weights on your toes.    Hold a weight in each hand and walk on your toes for a set distance or time.",
      "Video": "https://www.youtube.com/results?search_query=Farmers+Walk+on+Toes"
    },
    {
      "Muscles": "Calves",
      "WorkOut": "Jump Rope",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Weighted vest or dumbbells",
      "Explaination": "Increases calf endurance and coordination, beneficial for cardiovascular health.",
      "Long Explanation": "Jump over a rope that is swung under your feet.    Hold the ends of a jump rope and swing it under your feet, jumping over it each time it comes around.",
      "Video": "https://www.youtube.com/results?search_query=Jump+Rope"
    },
    {
      "Muscles": "Calves",
      "WorkOut": "Stair Climbs",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Jump rope",
      "Explaination": "Strengthens calves and improves cardiovascular endurance.",
      "Long Explanation": "Climb stairs for a set amount of time.    Find a set of stairs and climb up and down them continuously for a set amount of time.",
      "Video": "https://www.youtube.com/results?search_query=Stair+Climbs"
    },
    {
      "Muscles": "Calves",
      "WorkOut": "Dumbbell Jump Squat",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Stairs",
      "Explaination": "Builds explosive power and strength in the lower body, particularly in the calves.",
      "Long Explanation": "Squat and jump holding dumbbells.    Hold a dumbbell in each hand at your sides. Squat down, then jump up explosively.",
      "Video": "https://www.youtube.com/results?search_query=Dumbbell+Jump+Squat"
    },
    {
      "Muscles": "Calves",
      "WorkOut": "Barbell Seated Calf Raise",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbells",
      "Explaination": "Targets the soleus muscle, essential for improving calf strength and endurance.",
      "Long Explanation": "Raise your heels while sitting with a barbell on your knees.    Sit on a weight bench with a barbell on your knees. Raise your heels as high as possible, then lower them back down.",
      "Video": "https://www.youtube.com/results?search_query=Barbell+Seated+Calf+Raise"
    },
    {
      "Muscles": "Calves",
      "WorkOut": "Leg Press Calf Raise",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell and weight bench",
      "Explaination": "Strengthens the calves, utilizing the leg press machine for focused calf training.",
      "Long Explanation": "Raise your heels on a leg press machine.    Sit on a leg press machine with your feet on the lower part of the platform. Push the platform away from you by extending your knees, then return to the starting position.",
      "Video": "https://www.youtube.com/results?search_query=Leg+Press+Calf+Raise"
    },
    {
      "Muscles": "Calves",
      "WorkOut": "Reverse Calf Raise",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Leg press machine",
      "Explaination": "Targets the tibialis anterior, balancing the development of the lower leg.",
      "Long Explanation": "Raise your heels while standing without weights.    Stand on a step or platform with your heels hanging off the edge. Raise your heels as high as possible, then lower them back down.",
      "Video": "https://www.youtube.com/results?search_query=Reverse+Calf+Raise"
    },
    {
      "Muscles": "Calves",
      "WorkOut": "Calf Raise on a Dumbbell",
      "Intensity_Level": "Beginner",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Bodyweight",
      "Explaination": "Allows for a greater range of motion in calf raises, enhancing calf development.",
      "Long Explanation": "Raise one heel while holding a dumbbell.    Stand on one leg with a dumbbell in one hand and your heel hanging off a step or platform. Raise your heel as high as possible, then lower it back down.",
      "Video": "https://www.youtube.com/results?search_query=Calf+Raise+on+a+Dumbbell"
    },
    {
      "Muscles": "Calves",
      "WorkOut": "Kettlebell Calf Raise",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbell",
      "Explaination": "Strengthens the calves with the added challenge of kettlebell weight.",
      "Long Explanation": "Swing a kettlebell between your legs and then up to chest height.    Stand with your feet shoulder-width apart holding a kettlebell between your legs. Swing the kettlebell up to chest height by extending your hips and knees, then let it swing back between your legs.",
      "Video": "https://www.youtube.com/results?search_query=Kettlebell+Calf+Raise"
    },
    {
      "Muscles": "Calves",
      "WorkOut": "Smith Machine Calf Raise",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Kettlebell",
      "Explaination": "Provides a stable way to perform calf raises, focusing on calf strength.",
      "Long Explanation": "Raise your heels on a Smith machine.    Stand on a step or platform with your heels hanging off the edge and the bar of a Smith machine resting on your shoulders. Raise your heels as high as possible, then lower them back down.",
      "Video": "https://www.youtube.com/results?search_query=Smith+Machine+Calf+Raise"
    },
    {
      "Muscles": "Quadriceps",
      "WorkOut": "Squats",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Smith machine",
      "Explaination": "Builds overall leg strength, particularly in the quadriceps, hamstrings, and glutes.",
      "Long Explanation": "Bend your knees and lower your body, then stand back up.    Stand with your feet shoulder-width apart. Bend your knees and lower your body as if sitting back in a chair, then stand back up.",
      "Video": "https://www.youtube.com/results?search_query=Squats"
    },
    {
      "Muscles": "Quadriceps",
      "WorkOut": "Lunges",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell",
      "Explaination": "Enhances leg strength and stability, targeting the quadriceps, glutes, and hamstrings.",
      "Long Explanation": "Step forward and lower your body, then return to the starting position.    Stand with your feet shoulder-width apart. Step forward with one foot and lower your body by bending your knees, then push back up to the starting position.",
      "Video": "https://www.youtube.com/results?search_query=Lunges"
    },
    {
      "Muscles": "Quadriceps",
      "WorkOut": "Leg Press",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell",
      "Explaination": "Focuses on the quadriceps, hamstrings, and glutes, building overall leg strength.",
      "Long Explanation": "Sit on a leg press machine and push the platform away from you.    Sit on a leg press machine with your feet on the platform. Push the platform away from you by extending your knees, then return to the starting position.",
      "Video": "https://www.youtube.com/results?search_query=Leg+Press"
    },
    {
      "Muscles": "Quadriceps",
      "WorkOut": "Hack Squats",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Leg press machine",
      "Explaination": "Targets the quadriceps, offering a variation to the traditional squat.",
      "Long Explanation": "Squat while holding onto handles on a machine.    Stand on a hack squat machine with your feet shoulder-width apart. Squat down while holding onto the handles, then stand back up.",
      "Video": "https://www.youtube.com/results?search_query=Hack+Squats"
    },
    {
      "Muscles": "Quadriceps",
      "WorkOut": "Leg Extensions",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Smith machine or squat rack",
      "Explaination": "Isolates the quadriceps, essential for knee stability and leg strength.",
      "Long Explanation": "Sit on a machine and extend your legs in front of you.    Sit on a leg extension machine with your feet under the pad. Extend your legs in front of you, then return to the starting position.",
      "Video": "https://www.youtube.com/results?search_query=Leg+Extensions"
    },
    {
      "Muscles": "Quadriceps",
      "WorkOut": "Front Squats",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Leg extension machine",
      "Explaination": "Emphasizes the quadriceps and upper back, improving posture and leg strength.",
      "Long Explanation": "Squat while holding a barbell in front of your shoulders.    Stand with your feet shoulder-width apart holding a barbell in front of your shoulders. Squat down, then stand back up.",
      "Video": "https://www.youtube.com/results?search_query=Front+Squats"
    },
    {
      "Muscles": "Quadriceps",
      "WorkOut": "Bulgarian Split Squats",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell",
      "Explaination": "Strengthens each leg individually, focusing on the quadriceps and glutes.",
      "Long Explanation": "Do a lunge with one leg elevated behind you.    Stand about two feet in front of a bench or platform. Place one foot on the bench and lower your body by bending your front knee, then stand back up.",
      "Video": "https://www.youtube.com/results?search_query=Bulgarian+Split+Squats"
    },
    {
      "Muscles": "Quadriceps",
      "WorkOut": "Box Jumps",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbell and bench or platform",
      "Explaination": "Builds lower body power and strength, particularly in the quadriceps and calves.",
      "Long Explanation": "Jump onto a box and then step back down.    Stand in front of a box. Squat down, then explosively jump up onto the box. Step back down and repeat.",
      "Video": "https://www.youtube.com/results?search_query=Box+Jumps"
    },
    {
      "Muscles": "Quadriceps",
      "WorkOut": "Step-Ups",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Box or platform",
      "Explaination": "Strengthens the quadriceps and glutes, improving balance and unilateral leg strength.",
      "Long Explanation": "Step up onto a bench or platform, then step back down.    Stand in front of a bench or platform. Step up with one foot, then the other, and step back down.",
      "Video": "https://www.youtube.com/results?search_query=Step-Ups"
    },
    {
      "Muscles": "Quadriceps",
      "WorkOut": "Single-Leg Squats",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Bench or platform",
      "Explaination": "Enhances strength and balance in the quadriceps, glutes, and core.",
      "Long Explanation": "Bend one knee and lower your body, then stand back up.    Stand on one leg with the other leg extended in front of you. Bend your knee and lower your body, then stand back up.",
      "Video": "https://www.youtube.com/results?search_query=Single-Leg+Squats"
    },
    {
      "Muscles": "Quadriceps",
      "WorkOut": "Goblet Squat",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Bodyweight",
      "Explaination": "Strengthens the quadriceps, glutes, and core, with a focus on squat form.",
      "Long Explanation": "Hold a weight at chest height and squat.    Hold a weight at chest height with both hands. Squat down, then stand back up.",
      "Video": "https://www.youtube.com/results?search_query=Goblet+Squat"
    },
    {
      "Muscles": "Quadriceps",
      "WorkOut": "Smith Machine Squats",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Smith machine or squat rack",
      "Explaination": "Provides stability for squatting, focusing on the quadriceps and glutes.",
      "Long Explanation": "Squat while holding onto a bar on a Smith machine.    Stand on a Smith machine with your feet shoulder-width apart. Squat down while holding onto the bar, then stand back up.",
      "Video": "https://www.youtube.com/results?search_query=Smith+Machine+Squats"
    },
    {
      "Muscles": "Quadriceps",
      "WorkOut": "Sissy Squats",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Bodyweight",
      "Explaination": "Isolates the quadriceps, improving knee strength and quadriceps development.",
      "Long Explanation": "Bend your knees and lower your body, then stand back up without a barbell.    Stand with your feet shoulder-width apart. Bend your knees and lower your body as if sitting back in a chair, then stand back up without using a barbell.",
      "Video": "https://www.youtube.com/results?search_query=Sissy+Squats"
    },
    {
      "Muscles": "Quadriceps",
      "WorkOut": "Wall Sits",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Wall",
      "Explaination": "Builds endurance and strength in the quadriceps and glutes.",
      "Long Explanation": "Lean against a wall and squat down.    Lean against a wall with your feet shoulder-width apart. Slide down the wall into a squat position, then stand back up.",
      "Video": "https://www.youtube.com/results?search_query=Wall+Sits"
    },
    {
      "Muscles": "Quadriceps",
      "WorkOut": "Barbell Walking Lunges",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell",
      "Explaination": "Strengthens the entire lower body, particularly the quadriceps and glutes.",
      "Long Explanation": "Walk with a barbell on your shoulders.    Place a barbell on your shoulders. Walk forward for a set distance, keeping your back straight and your core engaged.",
      "Video": "https://www.youtube.com/results?search_query=Barbell+Walking+Lunges"
    },
    {
      "Muscles": "Trapezius",
      "WorkOut": "Barbell Shrugs",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell",
      "Explaination": "Targets the trapezius muscles, improving upper back and neck strength.",
      "Long Explanation": "Lift your shoulders while holding a barbell.    Stand with your feet shoulder-width apart holding a barbell. Lift your shoulders as high as possible, then lower them back down.",
      "Video": "https://www.youtube.com/results?search_query=Barbell+Shrugs"
    },
    {
      "Muscles": "Trapezius",
      "WorkOut": "Dumbbell Shrugs",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbells",
      "Explaination": "Isolates the trapezius muscles, enhancing upper back strength and posture.",
      "Long Explanation": "Lift your shoulders while holding dumbbells.    Stand with your feet shoulder-width apart holding a dumbbell in each hand. Lift your shoulders as high as possible, then lower them back down.",
      "Video": "https://www.youtube.com/results?search_query=Dumbbell+Shrugs"
    },
    {
      "Muscles": "Trapezius",
      "WorkOut": "Upright Rows",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell or dumbbells",
      "Explaination": "Strengthens the shoulders and trapezius, improving overall shoulder health.",
      "Long Explanation": "Lift a barbell to chin height.    Stand with your feet shoulder-width apart holding a barbell. Lift the barbell to chin height by bending your elbows, then",
      "Video": "https://www.youtube.com/results?search_query=Upright+Rows"
    },
    {
      "Muscles": "Trapezius",
      "WorkOut": "Face Pulls",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Cable machine",
      "Explaination": "Targets the rear deltoids and upper back, enhancing shoulder health and posture.",
      "Long Explanation": "Attach a rope to a high pulley and grasp it with both hands. Pull the rope towards your face while externally rotating your shoulders, so your hands are beside your ears at the end of the movement. Squeeze your shoulder blades together, then slowly return to the starting position.",
      "Video": "https://www.youtube.com/results?search_query=Face+Pulls"
    },
    {
      "Muscles": "Trapezius",
      "WorkOut": "Reverse Flyes",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell or rack",
      "Explaination": "Strengthens the rear deltoids and upper back, aiding in shoulder stabilization and posture.",
      "Long Explanation": "Hold a pair of dumbbells and bend forward at the hips, keeping your back straight. With a slight bend in the elbows, lift the dumbbells to the side until your arms are parallel to the floor. Squeeze your shoulder blades together, then lower the dumbbells back down.",
      "Video": "https://www.youtube.com/results?search_query=Reverse+Flyes"
    },
    {
      "Muscles": "Trapezius",
      "WorkOut": "Rack Pulls",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell",
      "Explaination": "Focuses on the upper back, glutes, and hamstrings, building overall posterior chain strength.",
      "Long Explanation": "Set up a barbell on a rack at knee height. Stand in front of the barbell, bend at your hips and knees, and grasp the bar with an overhand grip. Lift the bar by extending your hips and knees to full extension, then lower it back to the rack.",
      "Video": "https://www.youtube.com/results?search_query=Rack+Pulls"
    },
    {
      "Muscles": "Trapezius",
      "WorkOut": "Snatch Grip High Pull",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Cable machine",
      "Explaination": "Develops explosive power in the upper back and shoulders, improving overall athleticism.",
      "Long Explanation": "Grasp a barbell with a wide, overhand grip. Pull the bar up quickly, raising your elbows high. The bar should come up to chest height. Lower it back down in a controlled manner.",
      "Video": "https://www.youtube.com/results?search_query=Snatch+Grip+High+Pull"
    },
    {
      "Muscles": "Trapezius",
      "WorkOut": "Cable Shrugs",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell",
      "Explaination": "Isolates the trapezius muscles, building strength and size in the upper back.",
      "Long Explanation": "Stand in front of a cable machine with a bar attached to a low pulley. Grasp the bar with both hands and lift your shoulders to shrug the bar upwards, keeping your arms straight. Lower back down slowly.",
      "Video": "https://www.youtube.com/results?search_query=Cable+Shrugs"
    },
    {
      "Muscles": "Trapezius",
      "WorkOut": "Overhead Barbell Shrugs",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell or trap bar",
      "Explaination": "Targets the upper trapezius and shoulders, enhancing overall upper body strength.",
      "Long Explanation": "Hold a barbell above your head with an overhand grip. Shrug your shoulders upwards without bending your elbows, then lower them back down.",
      "Video": "https://www.youtube.com/results?search_query=Overhead+Barbell+Shrugs"
    },
    {
      "Muscles": "Trapezius",
      "WorkOut": "Trap Bar Shrugs",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Kettlebell",
      "Explaination": "Strengthens the traps and upper back with a neutral grip, reducing strain on shoulders.",
      "Long Explanation": "Stand inside a trap bar, grasp the handles, and lift your shoulders to perform a shrug. Keep your arms straight and focus on the upward movement of your shoulders. Lower back down slowly.",
      "Video": "https://www.youtube.com/results?search_query=Trap+Bar+Shrugs"
    },
    {
      "Muscles": "Trapezius",
      "WorkOut": "Kettlebell Sumo High Pull",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbell",
      "Explaination": "Increases explosive power in the hips and shoulders, improving functional strength.",
      "Long Explanation": "Stand with feet wider than shoulder-width, holding a kettlebell with both hands. Bend your knees slightly and explosively pull the kettlebell upwards, leading with your elbows. The kettlebell should reach chest height. Lower it back down in a controlled manner.",
      "Video": "https://www.youtube.com/results?search_query=Kettlebell+Sumo+High+Pull"
    },
    {
      "Muscles": "Trapezius",
      "WorkOut": "Single-Arm Dumbbell Upright Row",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Cable machine",
      "Explaination": "Isolates the shoulders and upper back, enhancing unilateral strength and balance.",
      "Long Explanation": "Hold a dumbbell in one hand and stand upright. Lift the dumbbell upwards alongside your body, keeping your elbow close to your side. Lower it back down after reaching shoulder height.",
      "Video": "https://www.youtube.com/results?search_query=Single-Arm+Dumbbell+Upright+Row"
    },
    {
      "Muscles": "Trapezius",
      "WorkOut": "Cable Face Pull with External Rotation",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell",
      "Explaination": "Strengthens the rear deltoids and rotator cuff, enhancing shoulder stability and health.",
      "Long Explanation": "Attach a rope to a cable machine set at upper chest height. Grasp the rope with both hands and pull it towards your forehead, rotating your hands so your palms face forward at the end of the movement. Slowly return to the starting position.",
      "Video": "https://www.youtube.com/results?search_query=Cable+Face+Pull+with+External+Rotation"
    },
    {
      "Muscles": "Trapezius",
      "WorkOut": "Barbell Row to Neck",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Smith machine",
      "Explaination": "Targets the upper back and traps, improving posture and upper back strength.",
      "Long Explanation": "Grasp a barbell with an overhand grip. Bend at the waist, keeping your back straight. Pull the barbell upwards towards your neck, leading with your elbows. Lower it back down in a controlled manner.",
      "Video": "https://www.youtube.com/results?search_query=Barbell+Row+to+Neck"
    },
    {
      "Muscles": "Trapezius",
      "WorkOut": "Smith Machine Upright Row",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell",
      "Explaination": "Provides stability in shoulder workouts, focusing on the upper back and traps.",
      "Long Explanation": "Set the Smith machine bar at waist height. Grasp the bar with an overhand grip and lift it by raising your elbows, keeping the bar close to your body. Lower it back down after reaching chest height.",
      "Video": "https://www.youtube.com/results?search_query=Smith+Machine+Upright+Row"
    },
    {
      "Muscles": "Shoulders",
      "WorkOut": "Military Press",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbells",
      "Explaination": "Builds overall shoulder strength and stability, essential for upper body development.",
      "Long Explanation": "Sit or stand with a barbell at shoulder height. Press the barbell upwards until your arms are fully extended overhead. Lower it back down to shoulder height.",
      "Video": "https://www.youtube.com/results?search_query=Military+Press"
    },
    {
      "Muscles": "Shoulders",
      "WorkOut": "Dumbbell Shoulder Press",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbells",
      "Explaination": "Strengthens the entire shoulder region, enhancing muscular balance and shoulder health.",
      "Long Explanation": "Sit or stand with a pair of dumbbells at shoulder height. Press the dumbbells upwards until your arms are fully extended. Lower them back down to shoulder height.",
      "Video": "https://www.youtube.com/results?search_query=Dumbbell+Shoulder+Press"
    },
    {
      "Muscles": "Shoulders",
      "WorkOut": "Lateral Raises",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell or dumbbells",
      "Explaination": "Isolates the lateral part of the shoulder, building width and strength.",
      "Long Explanation": "Hold a pair of dumbbells at your sides. Lift the dumbbells out to the sides until your arms are parallel to the floor, keeping a slight bend in your elbows. Lower them back down in a controlled manner.",
      "Video": "https://www.youtube.com/results?search_query=Lateral+Raises"
    },
    {
      "Muscles": "Shoulders",
      "WorkOut": "Front Raises",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Cable machine",
      "Explaination": "Targets the front deltoids, strengthening the anterior shoulder region.",
      "Long Explanation": "Stand with dumbbells in your hands. Lift the dumbbells straight in front of you until your arms are parallel to the floor, then lower them back down.",
      "Video": "https://www.youtube.com/results?search_query=Front+Raises"
    },
    {
      "Muscles": "Shoulders",
      "WorkOut": "Reverse Flyes",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell",
      "Explaination": "Enhances rear deltoid and upper back strength, balancing shoulder development.",
      "Long Explanation": "Bend forward at the waist with dumbbells in your hands. Lift the dumbbells out to the sides, squeezing your shoulder blades together. Lower them back down in a controlled manner.",
      "Video": "https://www.youtube.com/results?search_query=Reverse+Flyes"
    },
    {
      "Muscles": "Shoulders",
      "WorkOut": "Arnold Press",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbells",
      "Explaination": "Combines a shoulder press and bicep curl, targeting the entire shoulder complex.",
      "Long Explanation": "Sit with a pair of dumbbells at shoulder height, palms facing you. As you press the dumbbells overhead, rotate your arms so your palms face forward at the top. Lower them back down while rotating your palms back towards you.",
      "Video": "https://www.youtube.com/results?search_query=Arnold+Press"
    },
    {
      "Muscles": "Shoulders",
      "WorkOut": "Upright Rows",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Cable machine",
      "Explaination": "Strengthens the shoulders and traps, improving upper body muscular balance.",
      "Long Explanation": "Stand with a barbell or dumbbells. Lift the weight upwards by raising your elbows, keeping the bar close to your body. Lower it back down after reaching chest height.",
      "Video": "https://www.youtube.com/results?search_query=Upright+Rows"
    },
    {
      "Muscles": "Shoulders",
      "WorkOut": "Push Press",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Bench",
      "Explaination": "Develops explosive shoulder strength and power, beneficial for overall fitness.",
      "Long Explanation": "Start with a barbell at shoulder height. Dip your knees slightly, then explosively extend your legs and arms to press the barbell overhead. Lower it back down to shoulder height.",
      "Video": "https://www.youtube.com/results?search_query=Push+Press"
    },
    {
      "Muscles": "Shoulders",
      "WorkOut": "Barbell Shrugs",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbell",
      "Explaination": "Builds size and strength in the trapezius muscles, enhancing upper back development.",
      "Long Explanation": "Stand with a barbell and lift your shoulders to perform a shrug. Keep your arms straight and focus on the upward movement of your shoulders. Lower back down slowly.",
      "Video": "https://www.youtube.com/results?search_query=Barbell+Shrugs"
    },
    {
      "Muscles": "Shoulders",
      "WorkOut": "Bent-Over Dumbbell Lateral Raise",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Cable machine",
      "Explaination": "Isolates the lateral deltoids, improving shoulder width and balance.",
      "Long Explanation": "Bend forward with a pair of dumbbells. Lift the dumbbells out to the sides, keeping a slight bend in your elbows. Lower them back down in a controlled manner.",
      "Video": "https://www.youtube.com/results?search_query=Bent-Over+Dumbbell+Lateral+Raise"
    },
    {
      "Muscles": "Shoulders",
      "WorkOut": "Cable Lateral Raise",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell hip thrust bench or platform",
      "Explaination": "Strengthens the lateral deltoids with adjustable resistance, enhancing shoulder development.",
      "Long Explanation": "Stand in front of a cable machine with a handle attached to a low pulley. Lift the handle out to the side until your arm is parallel to the floor, then lower it back down.",
      "Video": "https://www.youtube.com/results?search_query=Cable+Lateral+Raise"
    },
    {
      "Muscles": "Shoulders",
      "WorkOut": "Seated Bent-Over Rear Delt Raise",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell",
      "Explaination": "Targets the rear deltoids and upper back, improving shoulder health and stability.",
      "Long Explanation": "Sit on a bench and lean forward. Hold a pair of dumbbells and lift them out to the sides, squeezing your shoulder blades together. Lower them back down in a controlled manner.",
      "Video": "https://www.youtube.com/results?search_query=Seated+Bent-Over+Rear+Delt+Raise"
    },
    {
      "Muscles": "Shoulders",
      "WorkOut": "Single-Arm Linear Jammer",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Dumbbells",
      "Explaination": "Builds unilateral shoulder strength and power, enhancing athletic performance.",
      "Long Explanation": "Stand in front of a machine or anchor point with a handle. Pull the handle downwards and across your body in a linear motion, then return to the starting position.",
      "Video": "https://www.youtube.com/results?search_query=Single-Arm+Linear+Jammer"
    },
    {
      "Muscles": "Shoulders",
      "WorkOut": "Standing Dumbbell Fly",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Barbell",
      "Explaination": "Strengthens the shoulders and upper chest, improving overall shoulder health.",
      "Long Explanation": "Stand with a pair of dumbbells and lift them out to the sides, slightly in front of your body. Lower them back down in a controlled manner.",
      "Video": "https://www.youtube.com/results?search_query=Standing+Dumbbell+Fly"
    },
    {
      "Muscles": "Shoulders",
      "WorkOut": "Machine Shoulder Press",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Kettlebell",
      "Explaination": "Provides a controlled environment for shoulder pressing, focusing on strength and stability.",
      "Long Explanation": "Sit in a shoulder press machine and press the handles upwards until your arms are fully extended. Lower them back down to shoulder height.",
      "Video": "https://www.youtube.com/results?search_query=Machine+Shoulder+Press"
    },
    {
      "Muscles": "Glutes",
      "WorkOut": "Hip Thrusts",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": "Bodyweight",
      "Explaination": "Targets the glutes and hamstrings, building strength and improving hip mobility.",
      "Long Explanation": "Sit on a bench with your upper back and shoulders supported. Place a barbell or weight across your hips. Lift your hips by squeezing your glutes, raising the barbell. Lower back down.",
      "Video": "https://www.youtube.com/results?search_query=Hip+Thrusts"
    },
    {
      "Muscles": "Glutes",
      "WorkOut": "Squats",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Builds overall leg strength, particularly in the quadriceps, hamstrings, and glutes.",
      "Long Explanation": "Stand with feet shoulder-width apart. Bend at the hips and knees to lower your body, then stand back up.",
      "Video": "https://www.youtube.com/results?search_query=Squats"
    },
    {
      "Muscles": "Glutes",
      "WorkOut": "Deadlifts",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Strengthens the entire posterior chain, essential for overall fitness and injury prevention.",
      "Long Explanation": "Stand with feet shoulder-width apart. Bend at the hips and knees to lower your body, grabbing a barbell. Stand up by straightening your hips and knees.",
      "Video": "https://www.youtube.com/results?search_query=Deadlifts"
    },
    {
      "Muscles": "Glutes",
      "WorkOut": "Lunges",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Enhances leg strength and stability, targeting the quadriceps, glutes, and hamstrings.",
      "Long Explanation": "Step forward with one leg and lower your body until the front thigh is parallel to the floor. Push back up to the starting position.",
      "Video": "https://www.youtube.com/results?search_query=Lunges"
    },
    {
      "Muscles": "Glutes",
      "WorkOut": "Glute Bridges",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Strengthens the glutes and hamstrings, improving lower body power and stability.",
      "Long Explanation": "Lie on your back with your feet flat on the floor. Lift your hips by squeezing your glutes. Lower back down.",
      "Video": "https://www.youtube.com/results?search_query=Glute+Bridges"
    },
    {
      "Muscles": "Glutes",
      "WorkOut": "Bulgarian Split Squats",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Improves strength and balance in the legs and glutes, with a focus on each leg individually.",
      "Long Explanation": "Stand a few feet in front of a bench. Place one foot on the bench behind you. Lower your body until the front thigh is parallel to the floor. Stand back up.",
      "Video": "https://www.youtube.com/results?search_query=Bulgarian+Split+Squats"
    },
    {
      "Muscles": "Glutes",
      "WorkOut": "Donkey Kicks",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Strengthens the glutes, improving lower body power and stability.",
      "Long Explanation": "Get on all fours. Kick one leg back and up, squeezing your glutes. Return to the starting position.",
      "Video": "https://www.youtube.com/results?search_query=Donkey+Kicks"
    },
    {
      "Muscles": "Glutes",
      "WorkOut": "Cable Kickbacks",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Targets the glutes, enhancing strength and definition in the posterior chain.",
      "Long Explanation": "Attach a cable to an ankle strap. Kick your leg back, squeezing your glutes. Return to the starting position.",
      "Video": "https://www.youtube.com/results?search_query=Cable+Kickbacks"
    },
    {
      "Muscles": "Glutes",
      "WorkOut": "Glute Kickback Machine",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Isolates the glutes, providing focused strength and muscular development.",
      "Long Explanation": "Stand behind a glute kickback machine. Place one foot against the footpad. Kick your leg back, squeezing your glutes. Return to the starting position.",
      "Video": "https://www.youtube.com/results?search_query=Glute+Kickback+Machine"
    },
    {
      "Muscles": "Glutes",
      "WorkOut": "Barbell Hip Thrust",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Strengthens the glutes and hamstrings, enhancing overall lower body power.",
      "Long Explanation": "Sit on a bench with your upper back and shoulders supported. Place a barbell across your hips. Lift your hips by squeezing your glutes, raising the barbell. Lower back down.",
      "Video": "https://www.youtube.com/results?search_query=Barbell+Hip+Thrust"
    },
    {
      "Muscles": "Glutes",
      "WorkOut": "Single-Leg Deadlift",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Improves balance, core stability, and strength in the hamstrings and glutes.",
      "Long Explanation": "Stand on one leg with a dumbbell in your hand. Bend forward at the hips, keeping your back straight. Stand back up.",
      "Video": "https://www.youtube.com/results?search_query=Single-Leg+Deadlift"
    },
    {
      "Muscles": "Glutes",
      "WorkOut": "Step-Ups",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Strengthens the lower body and core, improving balance and muscular endurance.",
      "Long Explanation": "Stand in front of a bench. Step up onto the bench with one leg, then step back down.",
      "Video": "https://www.youtube.com/results?search_query=Step-Ups"
    },
    {
      "Muscles": "Glutes",
      "WorkOut": "Romanian Deadlift",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Strengthens the hamstrings and glutes, improving posterior chain strength.",
      "Long Explanation": "Stand with feet shoulder-width apart. Hold a barbell. Bend at the hips and knees slightly, then stand back up.",
      "Video": "https://www.youtube.com/results?search_query=Romanian+Deadlift"
    },
    {
      "Muscles": "Glutes",
      "WorkOut": "Kettlebell Swing",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Builds power and strength in the hips and legs, enhancing athletic performance.",
      "Long Explanation": "Stand with feet shoulder-width apart. Swing a kettlebell between your legs, then thrust your hips forward to swing the kettlebell up to chest height.",
      "Video": "https://www.youtube.com/results?search_query=Kettlebell+Swing"
    },
    {
      "Muscles": "Glutes",
      "WorkOut": "Side Lunge",
      "Intensity_Level": "Intermediate",
      "Beginner Sets": "3 Sets with 12 to 15 reps",
      "Intermediate Sets": "4 Sets with 8 to 12 reps",
      "Expert Sets": "5 Sets with 3 to 10 reps",
      "Equipment": null,
      "Explaination": "Enhances leg strength and stability, focusing on the glutes and inner thighs.",
      "Long Explanation": "Step to the side and lower your body, bending the knee of the leading leg while keeping the other leg straight. Return to the starting position.",
      "Video": "https://www.youtube.com/results?search_query=Side+Lunge"
    }
  ]